STMicroelectronics/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP1xx/Source/Templates/gcc/startup_stm32mp157cxx_ca7.c
/**
  ******************************************************************************
  * @file    startup_stm32mp157c_ca7.c
  * @author  MCD Application Team
  * @brief   CMSIS Cortex-A7 Device Peripheral Access Layer A7 Startup source file.
  *
  *   This file :
  *      - sets up iInitial PC => Reset Handler
  *      - puts all A7 cores except first one on "Wait for interrupt"
  *      - configures cores
  *      - Sets up Exception vectors
  *      - sets up stacks for all exception modes
  *      - Call SystemInit to initialize IRQs, cahces, MMU, ...
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "stm32mp1xx.h"
#include "irq_ctrl.h"
/*----------------------------------------------------------------------------
  Definitions
 *----------------------------------------------------------------------------*/
#define USR_MODE 0x10            /* User mode */
#define FIQ_MODE 0x11            /* Fast Interrupt Request mode */
#define IRQ_MODE 0x12            /* Interrupt Request mode */
#define SVC_MODE 0x13            /* Supervisor mode */
#define ABT_MODE 0x17            /* Abort mode */
#define UND_MODE 0x1B            /* Undefined Instruction mode */
#define SYS_MODE 0x1F            /* System mode */

/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/
void Vectors       (void) __attribute__ ((naked, section("RESET")));
void Reset_Handler (void) __attribute__ ((naked));

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
void Undef_Handler (void) __attribute__ ((weak, alias("Default_Handler")));
void SVC_Handler   (void) __attribute__ ((weak, alias("Default_Handler")));
void PAbt_Handler  (void) __attribute__ ((weak, alias("Default_Handler")));
void DAbt_Handler  (void) __attribute__ ((weak, alias("Default_Handler")));
void Rsvd_Handler  (void) __attribute__ ((weak, alias("Default_Handler")));
void IRQ_Handler   (void) __attribute__ ((weak, alias("Default_Handler")));
void FIQ_Handler   (void) __attribute__ ((weak, alias("Default_Handler")));

/*----------------------------------------------------------------------------
  SoC External Interrupt Handler
 *----------------------------------------------------------------------------*/
void __attribute__ ((weak)) RESERVED_IRQHandler(void) {}
void __attribute__ ((weak)) SGI0_IRQHandler(void) {}
void __attribute__ ((weak)) SGI1_IRQHandler(void) {}
void __attribute__ ((weak)) SGI2_IRQHandler(void) {}
void __attribute__ ((weak)) SGI3_IRQHandler(void) {}
void __attribute__ ((weak)) SGI4_IRQHandler(void) {}
void __attribute__ ((weak)) SGI5_IRQHandler(void) {}
void __attribute__ ((weak)) SGI6_IRQHandler(void) {}
void __attribute__ ((weak)) SGI7_IRQHandler(void) {}
void __attribute__ ((weak)) SGI8_IRQHandler(void) {}
void __attribute__ ((weak)) SGI9_IRQHandler(void) {}
void __attribute__ ((weak)) SGI10_IRQHandler(void) {}
void __attribute__ ((weak)) SGI11_IRQHandler(void) {}
void __attribute__ ((weak)) SGI12_IRQHandler(void) {}
void __attribute__ ((weak)) SGI13_IRQHandler(void) {}
void __attribute__ ((weak)) SGI14_IRQHandler(void) {}
void __attribute__ ((weak)) SGI15_IRQHandler(void) {}

void __attribute__ ((weak)) VirtualMaintenanceInterrupt_IRQHandler(void) {}
void __attribute__ ((weak)) HypervisorTimer_IRQHandler(void) {}
void __attribute__ ((weak)) VirtualTimer_IRQHandler(void) {}
void __attribute__ ((weak)) Legacy_nFIQ_IRQHandler(void) {}
void __attribute__ ((weak)) SecurePhysicalTimer_IRQHandler(void) {}
void __attribute__ ((weak)) NonSecurePhysicalTimer_IRQHandler(void) {}
void __attribute__ ((weak)) Legacy_nIRQ_IRQHandler(void) {}

void __attribute__ ((weak)) WWDG1_IRQHandler(void) {}
void __attribute__ ((weak)) PVD_AVD_IRQHandler(void) {}
void __attribute__ ((weak)) TAMP_IRQHandler (void) {}
void __attribute__ ((weak)) RTC_WKUP_ALARM_IRQHandler (void) {}
void __attribute__ ((weak)) FLASH_IRQHandler(void) {}
void __attribute__ ((weak)) RCC_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI0_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI1_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI2_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI3_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI4_IRQHandler(void) {}
void __attribute__ ((weak)) DMA1_Stream0_IRQHandler(void) {}
void __attribute__ ((weak)) DMA1_Stream1_IRQHandler (void) {}
void __attribute__ ((weak)) DMA1_Stream2_IRQHandler (void) {}
void __attribute__ ((weak)) DMA1_Stream3_IRQHandler (void) {}
void __attribute__ ((weak)) DMA1_Stream4_IRQHandler (void) {}
void __attribute__ ((weak)) DMA1_Stream5_IRQHandler (void) {}
void __attribute__ ((weak)) DMA1_Stream6_IRQHandler (void) {}
void __attribute__ ((weak)) ADC1_IRQHandler(void) {}
void __attribute__ ((weak)) ADC2_IRQHandler(void) {}
void __attribute__ ((weak)) FDCAN1_IT0_IRQHandler(void) {}
void __attribute__ ((weak)) FDCAN2_IT0_IRQHandler(void) {}
void __attribute__ ((weak)) FDCAN1_IT1_IRQHandler(void) {}
void __attribute__ ((weak)) FDCAN2_IT1_IRQHandler(void) {}
void __attribute__ ((weak)) FDCAN_CAL_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI5_IRQHandler(void) {}
void __attribute__ ((weak)) TIM1_BRK_TIM9_IRQHandler(void) {}
void __attribute__ ((weak)) TIM1_UP_TIM10_IRQHandler(void) {}
void __attribute__ ((weak)) TIM1_TRG_COM_TIM11_IRQHandler (void) {}
void __attribute__ ((weak)) TIM1_CC_IRQHandler(void) {}
void __attribute__ ((weak)) TIM2_IRQHandler (void) {}
void __attribute__ ((weak)) TIM3_IRQHandler (void) {}
void __attribute__ ((weak)) TIM4_IRQHandler (void) {}
void __attribute__ ((weak)) I2C1_EV_IRQHandler(void) {}
void __attribute__ ((weak)) I2C1_ER_IRQHandler(void) {}
void __attribute__ ((weak)) I2C2_EV_IRQHandler(void) {}
void __attribute__ ((weak)) I2C2_ER_IRQHandler(void) {}
void __attribute__ ((weak)) SPI1_IRQHandler (void) {}
void __attribute__ ((weak)) SPI2_IRQHandler (void) {}
void __attribute__ ((weak)) USART1_IRQHandler (void) {}
void __attribute__ ((weak)) USART2_IRQHandler (void) {}
void __attribute__ ((weak)) USART3_IRQHandler (void) {}
void __attribute__ ((weak)) EXTI10_IRQHandler(void) {}
void __attribute__ ((weak)) RTC_Alarm_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI11_IRQHandler(void) {}
void __attribute__ ((weak)) TIM8_BRK_IRQHandler(void) {}
void __attribute__ ((weak)) TIM8_UP_IRQHandler(void) {}
void __attribute__ ((weak)) TIM8_TRG_COM_IRQHandler(void) {}
void __attribute__ ((weak)) TIM8_CC_IRQHandler(void) {}
void __attribute__ ((weak)) DMA1_Stream7_IRQHandler (void) {}
void __attribute__ ((weak)) FMC_IRQHandler(void) {}
void __attribute__ ((weak)) SDMMC1_IRQHandler(void) {}
void __attribute__ ((weak)) TIM5_IRQHandler (void) {}
void __attribute__ ((weak)) SPI3_IRQHandler (void) {}
void __attribute__ ((weak)) UART4_IRQHandler(void) {}
void __attribute__ ((weak)) UART5_IRQHandler(void) {}
void __attribute__ ((weak)) TIM6_IRQHandler(void) {}
void __attribute__ ((weak)) TIM7_IRQHandler (void) {}
void __attribute__ ((weak)) DMA2_Stream0_IRQHandler (void) {}
void __attribute__ ((weak)) DMA2_Stream1_IRQHandler (void) {}
void __attribute__ ((weak)) DMA2_Stream2_IRQHandler (void) {}
void __attribute__ ((weak)) DMA2_Stream3_IRQHandler (void) {}
void __attribute__ ((weak)) DMA2_Stream4_IRQHandler (void) {}
void __attribute__ ((weak)) ETH1_IRQHandler(void) {}
void __attribute__ ((weak)) ETH1_WKUP_IRQHandler (void) {}
void __attribute__ ((weak)) ETH1_LPI_IRQHandler (void) {}
void __attribute__ ((weak)) EXTI6_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI7_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI8_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI9_IRQHandler(void) {}
void __attribute__ ((weak)) DMA2_Stream5_IRQHandler (void) {}
void __attribute__ ((weak)) DMA2_Stream6_IRQHandler (void) {}
void __attribute__ ((weak)) DMA2_Stream7_IRQHandler (void) {}
void __attribute__ ((weak)) USART6_IRQHandler (void) {}
void __attribute__ ((weak)) I2C3_EV_IRQHandler(void) {}
void __attribute__ ((weak)) I2C3_ER_IRQHandler(void) {}
void __attribute__ ((weak)) USBH_OHCI_IRQHandler(void) {}
void __attribute__ ((weak)) USBH_EHCI_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI12_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI13_IRQHandler(void) {}
void __attribute__ ((weak)) DCMI_IRQHandler (void) {}
void __attribute__ ((weak)) CRYP1_IRQHandler(void) {}
void __attribute__ ((weak)) HASH1_IRQHandler(void) {}
void __attribute__ ((weak)) UART7_IRQHandler(void) {}
void __attribute__ ((weak)) UART8_IRQHandler(void) {}
void __attribute__ ((weak)) SPI4_IRQHandler (void) {}
void __attribute__ ((weak)) SPI5_IRQHandler (void) {}
void __attribute__ ((weak)) SPI6_IRQHandler (void) {}
void __attribute__ ((weak)) SAI1_IRQHandler (void) {}
void __attribute__ ((weak)) LTDC_IRQHandler (void) {}
void __attribute__ ((weak)) LTDC_ER_IRQHandler(void) {}
void __attribute__ ((weak)) SAI2_IRQHandler (void) {}
void __attribute__ ((weak)) QUADSPI_IRQHandler(void) {}
void __attribute__ ((weak)) LPTIM1_IRQHandler(void) {}
void __attribute__ ((weak)) CEC_IRQHandler(void) {}
void __attribute__ ((weak)) I2C4_EV_IRQHandler(void) {}
void __attribute__ ((weak)) I2C4_ER_IRQHandler(void) {}
void __attribute__ ((weak)) SPDIF_RX_IRQHandler (void) {}
void __attribute__ ((weak)) OTG_IRQHandler(void) {}
void __attribute__ ((weak)) IPCC_RX0_IRQHandler(void) {}
void __attribute__ ((weak)) IPCC_TX0_IRQHandler(void) {}
void __attribute__ ((weak)) DMAMUX1_OVR_IRQHandler(void) {}
void __attribute__ ((weak)) IPCC_RX1_IRQHandler(void) {}
void __attribute__ ((weak)) IPCC_TX1_IRQHandler(void) {}
void __attribute__ ((weak)) CRYP2_IRQHandler(void) {}
void __attribute__ ((weak)) HASH2_IRQHandler(void) {}
void __attribute__ ((weak)) I2C5_EV_IRQHandler(void) {}
void __attribute__ ((weak)) I2C5_ER_IRQHandler(void) {}
void __attribute__ ((weak)) GPU_IRQHandler(void) {}
void __attribute__ ((weak)) DFSDM1_FLT0_IRQHandler(void) {}
void __attribute__ ((weak)) DFSDM1_FLT1_IRQHandler(void) {}
void __attribute__ ((weak)) DFSDM1_FLT2_IRQHandler(void) {}
void __attribute__ ((weak)) DFSDM1_FLT3_IRQHandler(void) {}
void __attribute__ ((weak)) SAI3_IRQHandler(void) {}
void __attribute__ ((weak)) TIM15_IRQHandler (void) {}
void __attribute__ ((weak)) TIM16_IRQHandler (void) {}
void __attribute__ ((weak)) TIM17_IRQHandler (void) {}
void __attribute__ ((weak)) TIM12_IRQHandler (void) {}
void __attribute__ ((weak)) MDIOS_IRQHandler (void) {}
void __attribute__ ((weak)) EXTI14_IRQHandler(void) {}
void __attribute__ ((weak)) MDMA_IRQHandler(void) {}
void __attribute__ ((weak)) DSI_IRQHandler (void) {}
void __attribute__ ((weak)) SDMMC2_IRQHandler(void) {}
void __attribute__ ((weak)) HSEM_IT1_IRQHandler(void) {}
void __attribute__ ((weak)) EXTI15_IRQHandler(void) {}
void __attribute__ ((weak)) nCTIIRQ1_IRQHandler(void) {}
void __attribute__ ((weak)) nCTIIRQ2_IRQHandler(void) {}
void __attribute__ ((weak)) TIM13_IRQHandler(void) {}
void __attribute__ ((weak)) TIM14_IRQHandler(void) {}
void __attribute__ ((weak)) DAC_IRQHandler(void) {}
void __attribute__ ((weak)) RNG1_IRQHandler(void) {}
void __attribute__ ((weak)) RNG2_IRQHandler(void) {}
void __attribute__ ((weak)) I2C6_EV_IRQHandler(void) {}
void __attribute__ ((weak)) I2C6_ER_IRQHandler(void) {}
void __attribute__ ((weak)) SDMMC3_IRQHandler(void) {}
void __attribute__ ((weak)) LPTIM2_IRQHandler(void) {}
void __attribute__ ((weak)) LPTIM3_IRQHandler(void) {}
void __attribute__ ((weak)) LPTIM4_IRQHandler(void) {}
void __attribute__ ((weak)) LPTIM5_IRQHandler(void) {}
void __attribute__ ((weak)) MCU_SEV_IRQHandler(void) {}
void __attribute__ ((weak)) SAI4_IRQHandler(void) {}
void __attribute__ ((weak)) DTS_IRQHandler(void) {}
void __attribute__ ((weak)) WAKEUP_PIN_IRQHandler(void) {}
void __attribute__ ((weak)) TIM1_BRK_IRQHandler(void) {}
void __attribute__ ((weak)) TIM1_UP_IRQHandler(void) {}
void __attribute__ ((weak)) TIM1_TRG_COM_IRQHandler(void) {}
void __attribute__ ((weak)) RTC_TIMESTAMP_IRQHandler(void) {}
void __attribute__ ((weak)) DFSDM1_FLT4_IRQHandler(void) {}
void __attribute__ ((weak)) DFSDM1_FLT5_IRQHandler(void) {}
void __attribute__ ((weak)) MDMA_SEC_IT_IRQHandler(void) {}
void __attribute__ ((weak)) SYSRESETQ_IRQHandler(void) {}
void __attribute__ ((weak)) TAMP_SERR_S_IRQHandler(void) {}
void __attribute__ ((weak)) IWDG1_IRQHandler(void) {}
void __attribute__ ((weak)) IWDG2_IRQHandler(void) {}
void __attribute__ ((weak)) RTC_WKUP_ALARM_S_IRQHandler(void) {}
void __attribute__ ((weak)) RTC_TS_SERR_S_IRQHandler(void) {}
void __attribute__ ((weak)) WWDG1_RST_IRQHandler(void) {}


IRQHandler_t IRQ_Vector_Table[MAX_IRQ_n] = {
    /* Software Generated Interrupts */
    SGI0_IRQHandler,                    /* 0 */
    SGI1_IRQHandler,
    SGI2_IRQHandler,
    SGI3_IRQHandler,
    SGI4_IRQHandler,
    SGI5_IRQHandler,
    SGI6_IRQHandler,
    SGI7_IRQHandler,
    SGI8_IRQHandler,
    SGI9_IRQHandler,
    SGI10_IRQHandler,                   /* 10 */
    SGI11_IRQHandler,
    SGI12_IRQHandler,
    SGI13_IRQHandler,
    SGI14_IRQHandler,
    SGI15_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,                /* 20 */
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    /* Private Peripheral Interrupts */
    VirtualMaintenanceInterrupt_IRQHandler,
    HypervisorTimer_IRQHandler,
    VirtualTimer_IRQHandler,
    Legacy_nFIQ_IRQHandler,
    SecurePhysicalTimer_IRQHandler,
    NonSecurePhysicalTimer_IRQHandler,  /* 30 */
    Legacy_nIRQ_IRQHandler,
    /******  STM32 specific Interrupt Numbers **********************************************************************/
    WWDG1_IRQHandler,
    PVD_AVD_IRQHandler,
    TAMP_IRQHandler,
    RTC_WKUP_ALARM_IRQHandler,
    RESERVED_IRQHandler,
    RCC_IRQHandler,
    EXTI0_IRQHandler,
    EXTI1_IRQHandler,
    EXTI2_IRQHandler,                   /* 40 */
    EXTI3_IRQHandler,
    EXTI4_IRQHandler,
    DMA1_Stream0_IRQHandler,
    DMA1_Stream1_IRQHandler,
    DMA1_Stream2_IRQHandler,
    DMA1_Stream3_IRQHandler,
    DMA1_Stream4_IRQHandler,
    DMA1_Stream5_IRQHandler,
    DMA1_Stream6_IRQHandler,
    ADC1_IRQHandler,                     /* 50 */
    FDCAN1_IT0_IRQHandler,
    FDCAN2_IT0_IRQHandler,
    FDCAN1_IT1_IRQHandler,
    FDCAN2_IT1_IRQHandler,
    EXTI5_IRQHandler,
    TIM1_BRK_TIM9_IRQHandler,
    TIM1_UP_TIM10_IRQHandler,
    TIM1_TRG_COM_TIM11_IRQHandler,
    TIM1_CC_IRQHandler,
    TIM2_IRQHandler,                    /* 60 */
    TIM3_IRQHandler,
    TIM4_IRQHandler,
    I2C1_EV_IRQHandler,
    I2C1_ER_IRQHandler,
    I2C2_EV_IRQHandler,
    I2C2_ER_IRQHandler,
    SPI1_IRQHandler,
    SPI2_IRQHandler,
    USART1_IRQHandler,
    USART2_IRQHandler,                  /* 70 */
    USART3_IRQHandler,
    EXTI10_IRQHandler,
    RTC_Alarm_IRQHandler,
    EXTI11_IRQHandler,
    TIM8_BRK_IRQHandler,
    TIM8_UP_IRQHandler,
    TIM8_TRG_COM_IRQHandler,
    TIM8_CC_IRQHandler,
    DMA1_Stream7_IRQHandler,
    FMC_IRQHandler,                     /* 80 */
    SDMMC1_IRQHandler,
    TIM5_IRQHandler,
    SPI3_IRQHandler,
    UART4_IRQHandler,
    UART5_IRQHandler,
    TIM6_IRQHandler,
    TIM7_IRQHandler,
    DMA2_Stream0_IRQHandler,
    DMA2_Stream1_IRQHandler,
    DMA2_Stream2_IRQHandler,            /* 90 */
    DMA2_Stream3_IRQHandler,
    DMA2_Stream4_IRQHandler,
    ETH1_IRQHandler,
    ETH1_WKUP_IRQHandler,
    FDCAN_CAL_IRQHandler,
    EXTI6_IRQHandler,
    EXTI7_IRQHandler,
    EXTI8_IRQHandler,
    EXTI9_IRQHandler,
    DMA2_Stream5_IRQHandler,            /* 100 */
    DMA2_Stream6_IRQHandler,
    DMA2_Stream7_IRQHandler,
    USART6_IRQHandler,
    I2C3_EV_IRQHandler,
    I2C3_ER_IRQHandler,
    USBH_OHCI_IRQHandler,
    USBH_EHCI_IRQHandler,
    EXTI12_IRQHandler,
    EXTI13_IRQHandler,
    DCMI_IRQHandler,                    /* 110 */
    CRYP1_IRQHandler,
    HASH1_IRQHandler,
    RESERVED_IRQHandler,
    UART7_IRQHandler,
    UART8_IRQHandler,
    SPI4_IRQHandler,
    SPI5_IRQHandler,
    SPI6_IRQHandler,
    SAI1_IRQHandler,
    LTDC_IRQHandler,                    /* 120 */
    LTDC_ER_IRQHandler,
    ADC2_IRQHandler,
    SAI2_IRQHandler ,
    QUADSPI_IRQHandler,
    LPTIM1_IRQHandler,
    CEC_IRQHandler,
    I2C4_EV_IRQHandler,
    I2C4_ER_IRQHandler,
    SPDIF_RX_IRQHandler ,
    OTG_IRQHandler,                    /* 130 */
    RESERVED_IRQHandler,
    IPCC_RX0_IRQHandler,
    IPCC_TX0_IRQHandler,
    DMAMUX1_OVR_IRQHandler,
    IPCC_RX1_IRQHandler,
    IPCC_TX1_IRQHandler,
    CRYP2_IRQHandler,
    HASH2_IRQHandler,
    I2C5_EV_IRQHandler,
    I2C5_ER_IRQHandler,                 /* 140 */
    GPU_IRQHandler,
    DFSDM1_FLT0_IRQHandler,
    DFSDM1_FLT1_IRQHandler,
    DFSDM1_FLT2_IRQHandler,
    DFSDM1_FLT3_IRQHandler,
    SAI3_IRQHandler,
    DFSDM1_FLT4_IRQHandler,
    TIM15_IRQHandler,
    TIM16_IRQHandler,
    TIM17_IRQHandler,                   /* 150 */
    TIM12_IRQHandler,
    MDIOS_IRQHandler,
    EXTI14_IRQHandler,
    MDMA_IRQHandler,
    DSI_IRQHandler,
    SDMMC2_IRQHandler,
    HSEM_IT1_IRQHandler,
    DFSDM1_FLT5_IRQHandler,
    EXTI15_IRQHandler,
    MDMA_SEC_IT_IRQHandler,             /* 160 */
    SYSRESETQ_IRQHandler,
    TIM13_IRQHandler,
    TIM14_IRQHandler,
    DAC_IRQHandler,
    RNG1_IRQHandler,
    RNG2_IRQHandler,
    I2C6_EV_IRQHandler,
    I2C6_ER_IRQHandler,
    SDMMC3_IRQHandler,
    LPTIM2_IRQHandler,                  /* 170 */
    LPTIM3_IRQHandler,
    LPTIM4_IRQHandler,
    LPTIM5_IRQHandler,
    ETH1_LPI_IRQHandler,
    WWDG1_RST_IRQHandler,
    MCU_SEV_IRQHandler,
    RESERVED_IRQHandler,
    SAI4_IRQHandler,
    DTS_IRQHandler,
    RESERVED_IRQHandler,               /* 180 */
    WAKEUP_PIN_IRQHandler,
    IWDG1_IRQHandler,
    IWDG2_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,                /* 190 */
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,                /* 200 */
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,                /* 210 */
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,                /* 220 */
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    RESERVED_IRQHandler,
    TAMP_SERR_S_IRQHandler,
    RTC_WKUP_ALARM_S_IRQHandler,        /* 230 */
    RTC_TS_SERR_S_IRQHandler,
};

/*----------------------------------------------------------------------------
  Exception / Interrupt Vector Table
 *----------------------------------------------------------------------------*/
void Vectors(void) {
  __asm__ volatile(
  ".align 7                                         \n"
  "LDR    PC, =Reset_Handler                        \n"
  "LDR    PC, =Undef_Handler                        \n"
  "LDR    PC, =SVC_Handler                          \n"
  "LDR    PC, =PAbt_Handler                         \n"
  "LDR    PC, =DAbt_Handler                         \n"
  "LDR    PC, =Rsvd_Handler                         \n"
  "LDR    PC, =IRQ_Handler                          \n"
  "LDR    PC, =FIQ_Handler                          \n"
  );
}

/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
void Reset_Handler(void) {
  __asm__ volatile(
  ".code 32                                         \n"
  /* Mask interrupts */
  "CPSID   if                                      \n"

